src/xml/request_templates/bog_mg_test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openformat" xmlns:os="http://oss.dbc.dk/ns/opensearch" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:dkabm="http://biblstandard.dk/abm/namespace/dkabm/" xmlns:ISO639-2="http://lcweb.loc.gov/standards/iso639-2/" xmlns:dcmitype="http://purl.org/dc/dcmitype/" xmlns:dcterms="http://purl.org/dc/terms/" xmlns:ac="http://biblstandard.dk/ac/namespace/" xmlns:dkdcplus="http://biblstandard.dk/abm/namespace/dkdcplus/" xmlns:oss="http://oss.dbc.dk/ns/osstypes" xmlns:marcx="info:lc/xmlns/marcxchange-v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <ns1:formatRequest>
      <ns1:originalData>
        <os:collection>
          <os:resultPosition>1</os:resultPosition>
          <os:numberOfObjects>1</os:numberOfObjects>
          <os:object>
            <dkabm:record>
              <ac:identifier>006834297|810010</ac:identifier>
              <dc:identifier xsi:type="dcterms:URI">http://galenet.galegroup.com/servlet/ECCO?c=1&amp;stp=Author&amp;ste=11&amp;af=BN&amp;ae=T052937&amp;tiPG=1&amp;dd=0&amp;dc=flc&amp;docNum=CW114091851&amp;vrsn=1.0&amp;srchtp=a&amp;d4=0.33&amp;n=10&amp;SU=0LRK&amp;locID=dkb</dc:identifier>
              <ac:source>Bibliotekskatalog</ac:source>
              <dc:title>Robin Goodfellow; a fairy tale. Written by a fairy. For the amusement of all the pretty little faies and fairies in Great Britain and Ireland</dc:title>
              <dc:title xsi:type="dkdcplus:full">Robin Goodfellow; a fairy tale. Written by a fairy. For the amusement of all the pretty little faies and fairies in Great Britain and Ireland</dc:title>
              <dc:description>With three final leaves of advertisements</dc:description>
              <dc:description>Reproduction of original from the British Library</dc:description>
              <dcterms:audience>voksenmaterialer</dcterms:audience>
              <dc:publisher>printed for F. Newbery</dc:publisher>
              <dc:contributor>Fairy</dc:contributor>
              <dc:date>1770</dc:date>
              <dc:type xsi:type="dkdcplus:BibDK-Type">Ebog</dc:type>
              <dc:language xsi:type="dcterms:ISO639-2">eng</dc:language>
              <dc:language>Engelsk</dc:language>
            </dkabm:record>
            <marcx:collection>
              <marcx:record format="danMARC2" type="Bibliographic">
                <marcx:leader>00000n    2200000   4500</marcx:leader>
                <marcx:datafield ind1="0" ind2="0" tag="001">
                  <marcx:subfield code="a">006834297</marcx:subfield>
                  <marcx:subfield code="b">810010</marcx:subfield>
                  <marcx:subfield code="f">a</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="002">
                  <marcx:subfield code="d">ESTCT52937</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="004">
                  <marcx:subfield code="r">c</marcx:subfield>
                  <marcx:subfield code="a">e</marcx:subfield>
                  <marcx:subfield code="n">w</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="008">
                  <marcx:subfield code="t">m</marcx:subfield>
                  <marcx:subfield code="a">1770</marcx:subfield>
                  <marcx:subfield code="b">gb</marcx:subfield>
                  <marcx:subfield code="l">eng</marcx:subfield>
                  <marcx:subfield code="n">b</marcx:subfield>
                  <marcx:subfield code="v">4</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="009">
                  <marcx:subfield code="a">a</marcx:subfield>
                  <marcx:subfield code="g">xe</marcx:subfield>
                  <marcx:subfield code="b">t</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="090">
                  <marcx:subfield code="a">18</marcx:subfield>
                  <marcx:subfield code="c">f</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="091">
                  <marcx:subfield code="a">Bog</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="096">
                  <marcx:subfield code="z">810010</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="245">
                  <marcx:subfield code="a">Robin Goodfellow; a fairy tale. Written by a fairy. For the amusement of all the pretty little faies and fairies in Great Britain and Ireland</marcx:subfield>
                  <marcx:subfield code="m">elektronisk materiale</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="260">
                  <marcx:subfield code="a">London</marcx:subfield>
                  <marcx:subfield code="b">printed for F. Newbery</marcx:subfield>
                  <marcx:subfield code="c">1770</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="529">
                  <marcx:subfield code="i">Database</marcx:subfield>
                  <marcx:subfield code="a">Eighteenth Century Collection Online</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="559">
                  <marcx:subfield code="a">With three final leaves of advertisements</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="559">
                  <marcx:subfield code="a">Reproduction of original from the British Library</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="599">
                  <marcx:subfield code="a">ECCO</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="700">
                  <marcx:subfield code="a">Fairy</marcx:subfield>
                </marcx:datafield>
                <marcx:datafield ind1="0" ind2="0" tag="856">
                  <marcx:subfield code="u">http://galenet.galegroup.com/servlet/ECCO?c=1&amp;stp=Author&amp;ste=11&amp;af=BN&amp;ae=T052937&amp;tiPG=1&amp;dd=0&amp;dc=flc&amp;docNum=CW114091851&amp;vrsn=1.0&amp;srchtp=a&amp;d4=0.33&amp;n=10&amp;SU=0LRK&amp;locID=dkb</marcx:subfield>
                </marcx:datafield>
              </marcx:record>
            </marcx:collection>
            <os:identifier>810010-katalog:006834297</os:identifier>
            <os:creationDate>2012-04-20</os:creationDate>
            <os:holdingsCount>1</os:holdingsCount>
            <os:lendingLibraries>1</os:lendingLibraries>
            <os:relations>
              <os:relation>
                <os:relationType>dbcaddi:hasOnlineAccess</os:relationType>
                <os:relationUri>http://galenet.galegroup.com/servlet/ECCO?c=1&amp;stp=Author&amp;ste=11&amp;af=BN&amp;ae=T052937&amp;tiPG=1&amp;dd=0&amp;dc=flc&amp;docNum=CW114091851&amp;vrsn=1.0&amp;srchtp=a&amp;d4=0.33&amp;n=10&amp;SU=0LRK&amp;locID=dkb</os:relationUri>
                <os:linkObject>
                  <os:linkTo>website</os:linkTo>
                  <os:linkCollectionIdentifier>810010-katalog</os:linkCollectionIdentifier>
                  <os:linkCollectionIdentifier>870970-forsk</os:linkCollectionIdentifier>
                </os:linkObject>
              </os:relation>
            </os:relations>
            <os:formatsAvailable>
              <os:format>dkabm</os:format>
              <os:format>marcxchange</os:format>
            </os:formatsAvailable>
          </os:object>
        </os:collection>
      </ns1:originalData>
      <ns1:outputFormat>PLACEHOLDER</ns1:outputFormat>
      <ns1:trackingId>bog_mg_test.xml.PLACEHOLDER</ns1:trackingId>
    </ns1:formatRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
